Tutorial4/ConedBottomDouble/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (370 20 990)
    (600 20 990)
    (600 1400 990)
    (370 1400 990)
    (370 20 1250)
    (600 20 1250)
    (600 1400 1250)
    (370 1400 1250)
   
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (46 276 52) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (1 5 4 0)
    )
    patch outlet
    (
     
	(2 6 5 1)
     )
    wall vessel
    (
        (0 4 7 3)
        (4 5 6 7)
	(3 7 6 2)
	(0 3 2 1)
      	    )
);

);



mergePatchPairs
(
);

// ************************************************************************* //
