Tutorial4/ConedBottomDouble/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
      vessel
    {
        type triSurfaceMesh;
        file "vessel.stl";
    }
 drafttube
    {
        type triSurfaceMesh;
        file "drafttube.stl";
    }
/*topDraft1
{
        type searchableCylinder;
        point1 (544.349  440 1044.545);
        point2 (544.349 510 1044.545);
        radius 110;
    }
bottomDraft1
{
        type searchableCylinder;
        point1 (544.349  180 1044.545);
        point2 (544.349  250 1044.545);
        radius 110;
    }
topDraft2
{
        type searchableCylinder;
        point1 (544.349  840 1044.545);
        point2 (544.349 910 1044.545);
        radius 110;
    }
bottomDraft2
{
        type searchableCylinder;
        point1 (544.349  610 1044.545);
        point2 (544.349  680 1044.545);
        radius 110;
    }*/


   
}


castellatedMeshControls
{

    maxLocalCells 100000;

    maxGlobalCells 2000000;

    minRefinementCells 0;

    nCellsBetweenLevels 2;

    maxLoadUnbalance 0.10;

    features
    (
        {
            file "vessel.eMesh";
            level 1;
        }

	{
            file "drafttube.eMesh";
            level 1;
        }



      
    );

    resolveFeatureAngle 30;

    refinementSurfaces
    {
       

        vessel
        {
            level (1 1);
	        }
 drafttube
        {
            level (1 1);
	        }
    
    }

    refinementRegions
{
       draftTube
	{
	level (1 1);
	}
 /*topDraft1
       {
            mode inside;
            levels ((1 1));
        }
 bottomDraft1
        {
            mode inside;
            levels ((1 1));
        }
 topDraft2
       {
            mode inside;
            levels ((1 1));
        }
 bottomDraft2
        {
            mode inside;
            levels ((1 1));
        }*/



    }

    locationInMesh (540 450 1075); // Inside point

    allowFreeStandingZoneFaces true;
}

// Settings for the snapping.
snapControls
{

    nSmoothPatch 3;

    tolerance 1.0;

    nSolveIter 300;

    nRelaxIter 10;

    nFeatureSnapIter 10;

    implicitFeatureSnap true;

    explicitFeatureSnap false;

    multiRegionFeatureSnap true;
}

// Settings for the layer addition.
addLayersControls
{

    relativeSizes true;

    layers
    {
    }

    expansionRatio 1.0;

    finalLayerThickness 0.3;

    minThickness 0.25;

    nGrow 0;

    featureAngle 30;

    nRelaxIter 5;

    nSmoothSurfaceNormals 1;

    nSmoothNormals 3;

    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;

    maxThicknessToMedialRatio 0.3;

    minMedianAxisAngle 90;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;

    nRelaxedIter 20;
}

meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        maxNonOrtho 75;
    }
}

writeFlags
(
);

mergeTolerance 1E-6;


// ************************************************************************* //
